server/app/controllers/application_controller.rb

  def create
    body = JSON.parse(request.body.read)

    workout = Workout.create({
      :title => body['title'],
      :textdata => body['textdata'],
      :createdat => body['createdat']
    })
---
INSERT INTO "workout" ("title", "textdata", "createdat") VALUES ($1, $2, $3) RETURNING "id"  [["title", "title"], ["textdata", "workout"], ["createdat", "2019-04-14 18:10:50.574000"]]

  def read
    render json: Workout.all
---
SELECT "workout".* FROM "workout"

  def delete
    params = request.query_parameters

    id = params["id"]

    if !id
      render json: { error: "No ID present" }
      return
    end

    workout = Workout.find_by(id: id)
    workout.destroy
---
SELECT  "workout".* FROM "workout" WHERE "workout"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
DELETE FROM "workout" WHERE "workout"."id" = $1  [["id", 13]]